package 间.安卓.资源.布局;

import android.content.Context;
import 间.安卓.工具.主题;
import 间.安卓.工具.应用;
import 间.安卓.视图.文本视图;
import 间.安卓.视图.线性布局;
import 间.安卓.视图.进度圈;
import 间.安卓.视图.进度条;

public class 布局_初始化 extends 布局_基本界面 {

    public 布局_初始化(Context $上下文) {

        super($上下文);

        底层.置填充("默认填充");
        
        进度条 $进度 = new 进度条(底层);
        $进度.置自动(true);
        $进度.置标签("进度");
        //$进度.置宽度("最大");
        $进度.置自动(true);
        //$进度.置填充("4dp");

        文本视图 $文本 = new 文本视图(底层);
        $文本.置标签("文本");
        $文本.置文本("正在校验环境 ~");
        $文本.置左填充(主题.取默认填充());

    }

}
